import React from "react";

import TextContainer from "../styles/TextContainer";

const Privacy = () => (
    <TextContainer>
        <h1>개인정보처리방침</h1>

        <p>
            <h3>1. 개인정보의 처리 목적</h3><br />
            ('teamkat.kt' 이하 'Team Kat')은(는) 개인정보를 다음의 목적을 위해 처리하며 처리한 개인정보는 다음의 목적이외의 용도로는 사용되지 않으며 이용 목적이 변경될 시에는 사전동의를 구할 예정입니다.<br /><br />
            • 서비스 가입 및 관리<br />
            • 서비스 제공<br />
            • 등등<br /><br />


            <h3>2. 개인정보의 처리 및 보유 기간</h3><br />
            Team Kat에서는 다음과 같은 항목들을 저장합니다<br /><br />
            • 필수항목<br />
            &nbsp;&nbsp;&nbsp;&nbsp;• 채팅 정보(작성자, 붙임자료, 반응 등), 사이트 방문 로그, 아이피<br />
            • 선택항목<br />
            &nbsp;&nbsp;&nbsp;&nbsp;• 이메일, 비밀번호, 사이트 ID, Discord ID 등 본인확인 정보<br /><br />
            필수항목에 해당되는 정보는 서비스 종료까지 저장되고 선택항목에 해당되는 정보는 서비스 종료 또는 서비스 탈퇴까지 저장됩니다<br />
            Team Kat 에서는 민감한 정보 (비밀번호 등) 은 암호화해서 저장합니다<br /><br />


            <h3>3. 개인정보의 제3자 제공에 관한 사항</h3>
            서비스 전용 개인정보(게시물 등)는 제 3자가 볼 수 있지만 나머지 개인정보는 절대로 제 3자에게 제공되지 않습니다<br /><br />


            <h3>4. 개인정보의 파기</h3>
            Team Kat은 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다.<br /><br />

            • 파기 절차<br />
            &nbsp;&nbsp;&nbsp;&nbsp;• 이용자가 입력한 정보는 파일이나 DB에 저장되 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.<br /><br />
            • 파기 절차<br />
            &nbsp;&nbsp;&nbsp;&nbsp;• 이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.<br /><br />


            <h3>5. 개인정보 자동 수집 장치의 설치, 운영 및 거부에 관한 사항</h3>
            • 이용정보의 저장을 거부할 경우 전체 서비스 이용에 어려움이 생길 수 있습니다.<h3 /><h3 />

            <h3>6. 개인정보 보호책임자</h3>
            Team Kat은 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.<br />
            정보주체께서는 Team Kat의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. Team Kat은 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.<br /><br />
            • 개인정보 보호책임자<br />
            &nbsp;&nbsp;&nbsp;&nbsp;• 성명: 정우현<br />
            &nbsp;&nbsp;&nbsp;&nbsp;• 직책: 대표<br />
            &nbsp;&nbsp;&nbsp;&nbsp;• 연락처: devkiki7000@gmail.com<br /><br />

            <h3>7. 개인정보 처리방침 변경</h3>
            이 개인정보처리방침은 시행일(2020년 12월 6일)로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공식 디스코드 서버 공지사항을 통하여 고지할 것입니다.<br /><br />

            <h3>8. 개인정보의 안전성 확보 조치</h3><br />
            <b>1. 정기적인 자체 감사 실시</b><br />
            개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체 감사를 실시하고 있습니다.<br /><br />
            <b>2. 해킹 등에 대비한 기술적 대책</b><br />
            Team Kat은 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 서버 정보를 제 3자에게 알려주지 않고 있으며 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.<br /><br />
            <b>3. 개인정보의 암호화</b><br />
            이용자의 정보중 민감한 정보(비밀번호 등)은 암호화 후 저장됩니다.<br /><br />
        </p>
    </TextContainer>
)

export default Privacy;